# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [3]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [40]:
series_1=pd.Series(np.random.randint(1,4,100))
series_2=pd.Series(np.random.randint(1,3,100))
series_3=pd.Series(np.random.randint(10000,30000,100))
print(series_1)
print(series_2)
print(series_3)

0     2
1     2
2     2
3     1
4     2
     ..
95    2
96    1
97    1
98    2
99    2
Length: 100, dtype: int32
0     2
1     2
2     1
3     2
4     2
     ..
95    1
96    1
97    2
98    1
99    1
Length: 100, dtype: int32
0     15910
1     16816
2     11930
3     12988
4     14893
      ...
95    17872
96    12453
97    15494
98    23916
99    21950
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [41]:
df=pd.concat([series_1,series_2,series_3],axis=1)
df

    0  1      2
0   2  2  15910
1   2  2  16816
2   2  1  11930
3   1  2  12988
4   2  2  14893
.. .. ..    ...
95  2  1  17872
96  1  1  12453
97  1  2  15494
98  2  1  23916
99  2  1  21950

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [42]:
df=df.rename(columns={0:'bedrs',1:'bathrs',2:'bathrs, price_sqr_meter'})
df

    bedrs  bathrs  bathrs, price_sqr_meter
0       2       2                    15910
1       2       2                    16816
2       2       1                    11930
3       1       2                    12988
4       2       2                    14893
..    ...     ...                      ...
95      2       1                    17872
96      1       1                    12453
97      1       2                    15494
98      2       1                    23916
99      2       1                    21950

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [43]:
bigcolumn=pd.concat([series_1,series_2,series_3],axis=0)
bigcolumn.to_frame()

        0
0       2
1       2
2       2
3       1
4       2
..    ...
95  17872
96  12453
97  15494
98  23916
99  21950

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [57]:
bigcolumn.in

<class 'pandas.core.series.Series'>
Int64Index: 300 entries, 0 to 99
Series name: None
Non-Null Count  Dtype
--------------  -----
300 non-null    int32
dtypes: int32(1)
memory usage: 3.5 KB

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [55]:
bigcolumn.reset_index(drop=True)

0          2
1          2
2          2
3          1
4          2
       ...
295    17872
296    12453
297    15494
298    23916
299    21950
Length: 300, dtype: int32